import random

rules = 'Правила в игре простые.\n\nНа столе лежат конфеты. Играют два игрока делая ход друг ' \
        'после друга. Первый ход определяется жеребьёвкой. За один ход можно забрать не ' \
        'более чем 28 конфет. Все конфеты оппонента достаются сделавшему последний ход.' \
        '\nПеред началом игры ты можешь поменять уровень и количество конфет.' \
        'Во время игры данные изменения внести не получится.' \
        '\n Чтобы задать максимальное количество конфет нажмите на кнопку /Set, а потом' \
        'наберите на клавиатуре /set (необходимое количество), по умолчанию конфет 150' \
        '\n Чтобы поменять уровень сложности нажмите на кнопку /level, нажатие меняет уровень'


set ='Для того чтобы задать максимальное количество конфет наберите /set (количество конфет)'


# bot_txt=random.randint(1, 13)
# if bot_txt == 1:
#         print('много берешь')
# if bot_txt ==2:
#         print(' Вот жадина')
# else:
#         print('Возьми поменьше')
#

